app/views/static_pages/checkout.html.haml

    .card-header
      - @line_items = @order.order_line_items
      .card-body
---
SELECT "order_line_items".* FROM "order_line_items" WHERE "order_line_items"."order_id" = ?  [["order_id", 3]]