app/models/concerns/current_order.rb

    def set_order
      @order = Order.find(cookies[:order_id])
      rescue ActiveRecord::RecordNotFound
        @order = Order.create(:state => '1')
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "orders" ("state", "created_at", "updated_at") VALUES (?, ?, ?)  [["state", 1], ["created_at", "2019-03-23 09:55:34.384321"], ["updated_at", "2019-03-23 09:55:34.384321"]]