app/controllers/admin_lte/inventory_items_controller.rb

    def index

      if params[:inventory_item]
        @inventory_items = InventoryItem.where('name LIKE ?', "%#{params[:inventory_item]}%").page(params[:page]).per(9)
      else
        @inventory_items = InventoryItem.page(params[:page]).per(9)
---
SELECT  "inventory_items".* FROM "inventory_items" LIMIT ? OFFSET ?  [["LIMIT", 9], ["OFFSET", 0]]