app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM (SELECT  1 AS one FROM "articles" LIMIT ? OFFSET ?) subquery_for_count  [["LIMIT", 10], ["OFFSET", 0]]
SELECT  "articles".* FROM "articles" ORDER BY created_at desc LIMIT ?  [["LIMIT", 5]]
---
  def index
    # @static_pages = InventoryItem.page(params[:page]).per(20)
    @articles = Article.page(params[:page]).per(10)
    @articles_in_order = Article.all.order("created_at desc").limit(5)

SELECT  "articles".* FROM "articles" ORDER BY created_at desc LIMIT ?  [["LIMIT", 5]]
---
  def show
    @articles_in_order = Article.all.order("created_at desc").limit(5)

UPDATE "articles" SET "name" = ?, "description" = ?, "content" = ?, "updated_at" = ? WHERE "articles"."id" = ?
---
  def update
    respond_to do |format|
      if @article.update(article_params)