app/controllers/inventory_items_controller.rb

    def set_inventory_item
      @inventory_item = InventoryItem.find(params[:id])
---
SELECT  "inventory_items".* FROM "inventory_items" WHERE "inventory_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]