app/controllers/order_line_items_controller.rb

SELECT  "inventory_items".* FROM "inventory_items" WHERE "inventory_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "order_line_items" ("inventory_item_id", "order_id", "total_price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["inventory_item_id", 1], ["order_id", 3], ["total_price", 700.0], ["created_at", "2019-03-23 13:55:04.479334"], ["updated_at", "2019-03-23 13:55:04.479334"]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def create
    #order = current_order
    #@order_line_item = OrderLineItem.new(order_line_item_params)
    #@order.save
    #session[:order_id] = @order.id
    inventory_item = InventoryItem.find(params[:inventory_item_id])

    if inventory_item.quantity == nil || inventory_item.quantity <= 0
      redirect_to home_path, notice: 'not enough.'
    else

      @order_line_item = @order.add_inventory_item(inventory_item)
      #binding.pry

      inventory_item.quantity = inventory_item.quantity - 1
      inventory_item.save
      #@order_line_item = OrderLineItem.new(order_line_item_params)
      respond_to do |format|
        if @order_line_item.save
          format.html { redirect_to @order_line_item.order, notice: 'Order line item was successfully created.' }