app/controllers/orders_controller.rb

UPDATE "orders" SET "cookies" = ?, "updated_at" = ? WHERE "orders"."id" = ?
UPDATE "orders" SET "user_id" = ?, "total_amount" = ?, "state" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["user_id", 2], ["total_amount", 700.0], ["state", 2], ["updated_at", "2019-03-23 13:56:29.050847"], ["id", 3]]
SELECT "order_line_items".* FROM "order_line_items" WHERE "order_line_items"."order_id" = ?  [["order_id", 3]]
SELECT  "inventory_items".* FROM "inventory_items" WHERE "inventory_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def update

    @order.cookies = cookies[:visited]
    cookies[:visited] = nil
    @order.save
    # binding.pry
    respond_to do |format|
      if @order.update(order_params)
        if user_signed_in? && current_user.admin
          format.html { redirect_to @order, notice: 'Order was successfully updated.' }
          format.json { render :show, status: :ok, location: @order }
        else
          if @order.state == 1
            # binding.pry
            format.html { redirect_to order_path, notice: 'Updated'}
            update_inventory_item_quantity_when_update_order
          elsif @order.state == 2
            @order.order_line_items.each do |f|
            f.fixed_item_price = f.inventory_item.price
            f.save
            @related_item = InventoryItem.find(f.inventory_item_id)
            @related_item.sold_quantity = @related_item.sold_quantity.to_i + f.order_item_qty.to_i